#include "search.h"

// Программа должна:
// 1. Сформировать массив записей.
// 2. Выполнить сортировку массива по ключевому полю.
// 3. Реализовать:
//     o линейный поиск;
//     o двоичный поиск.
// 4. Выполнить поиск в соответствии с вариантом.
// 5. Подсчитать количество обращений (сравнений).
// 6. Сравнить эффективность алгоритмов

// Программа должна выводить:
// • исходный массив;
// • отсортированный массив;
// • результат поиска;
// • количество обращений для каждого алгоритма;
// • сравнительный анализ.

// 20 Найти уникальные записи

int main(void)
{
    int length;
    struct Record records[length];


    return 0;
}